Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.KeepAxisEnum Enumeration
 The keep axis settings.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum KeepAxisEnum
Public Enumeration KeepAxisEnum
Members
Member name | Value | Description
KEEP_AXIS_NO | 0 |  The keep axis setting is "no".
KEEP_AXIS_LIMITED | 1 |  The keep axis setting is "limited".
KEEP_AXIS_YES | 2 |  The keep axis setting is "yes".
KEEP_AXIS_FULL | 3 |  The keep axis setting is "full".
See Also
Reference
Tekla.Structures.Analysis Namespace